package com.topjet.common.exception;


public enum ErrorCode {

    /**
     * 处理成功
     */
    E_0("0", "处理成功",0),

    /**
     * 出现未知错误,请联系系统管理员
     */
    E_SYS_0("E_SYS_0", "出现未知错误,请联系系统管理员",0),

    /**
     * 会话不存在,请联系系统管理员
     */
    E_SYS_1("E_SYS_1", "会话不存在,请联系系统管理员",0),

    /**
     * 会话错误,请联系系统管理员
     */
    E_SYS_2("E_SYS_2", "会话错误,请联系系统管理员",0),

    /**
     * 会话已过期,请重新登录
     */
    E_SYS_3("E_SYS_3", "会话已过期",0),

    /**
     * 未知请求
     */
    E_SYS_4("E_SYS_4", "未知请求",0),

    /**
     * 短信发送失败
     */
    E_SYS_5("E_SYS_5", "短信发送失败",0),

    /**
     * 图片上传失败
     */
    E_SYS_6("E_SYS_6", "图片上传失败",0),

    /**
     * 图片下载失败
     */
    E_SYS_7("E_SYS_7", "图片下载失败",0),

    /**
     * 缺少请求参数
     */
    E_SYS_8("E_SYS_8", "缺少请求参数",0),

    /**
     * 数据信息已过期,请重新加载!
     */
    E_SYS_9("E_SYS_9", "数据信息已过期,请重新加载!",0),

    /**
     * 推荐补贴尚未设置
     */
    E_SYS_10("E_SYS_10", "推荐补贴尚未设置",0),

    /**
     * 错误的请求参数
     */
    E_SYS_11("E_SYS_11", "错误的请求参数",0),

    /**
     * 没有版本更新信息
     */
    E_SYS_12("E_SYS_12", "没有版本更新信息",0),

    /**
     * 用户被冻结
     */
    E_SYS_13("E_SYS_13", "用户已被冻结,请联系客服",0),

    /**
     * 该用户没有对该数据的操作权限
     */
    E_SYS_14("E_SYS_14", "该用户没有对该数据的操作权限",0),
    
    /**
     * 数据错误,请联系数据库管理员确认数据正常!
     */
    E_SYS_15("E_SYS_15", "数据错误,请联系数据库管理员确认数据正常!",0),
    
    /**
     * 数据解密失败!
     */
    E_SYS_16("E_SYS_16", "数据解密失败!",0),

    /**
     * 您选择的货源已被抢走或撤销,请选择其他货源!
     */
    E_SYS_17("E_SYS_17", "您选择的货源已被抢走或撤销,请选择其他货源!",0),

    /**
     * 您尚未登录
     */
    E_USER_0("E_USER_0", "登录信息过期,请重新登录",0),

    /**
     * 用户密码错误
     */
    E_USER_1("E_USER_1", "您输入的密码错误,请重新输入",1023),

    /**
     * 验证码错误
     */
    E_USER_2("E_USER_2", "您输入的验证码错误,请重新输入",0),

    /**
     * 手机号错误
     */
    E_USER_3("E_USER_3", "您输入的手机号格式有误,请重新输入",0),

    /**
     * 手机号已注册
     */
    E_USER_4("E_USER_4", "您输入的手机号已经存在,请重新输入",1021),

    /**
     * 推荐人手机号错误或不是已注册用户
     */
    E_USER_5("E_USER_5", "推荐人手机号错误或不是已注册用户",0),

    /**
     * 当天发送验证码次数过多
     */
    E_USER_6("E_USER_6", "当天发送验证码次数过多",0),

    /**
     * 证件未提交
     */
    E_USER_7("E_USER_7", "用户证件未提交",0),

    /**
     * 待审核
     */
    E_USER_8("E_USER_8", "用户证件待审核",0),

    /**
     * 已冻结
     */
    E_USER_9("E_USER_9", "用户已冻结",0),

    /**
     * 该账户不存在
     */
    E_USER_10("E_USER_10", "您输入的手机号尚未注册,请重新输入",0),


    /**
     * 修改密码失败
     */
    E_USER_11("E_USER_11", "修改密码失败",0),

    /**
     * 修改密码失败
     */
    E_USER_12("E_USER_12", "旧密码填写错误",0),

    /**
     * 定位失败
     */
    E_USER_13("E_USER_13", "定位失败",0),

    /**
     * 无法获取车辆信息
     */
    E_USER_14("E_USER_14", "无法获取车辆信息",0),

    /**
     * 用户不存在或用户状态不符
     */
    E_USER_15("E_USER_15", "用户不存在或用户状态不符",0),

    /**
     * 身份证核查付款尚未完成
     */
    E_USER_16("E_USER_16", "身份证核查付款尚未完成",0),

    /**
     * 身份证格式错误
     */
    E_USER_17("E_USER_17", "身份证格式错误",0),

    /**
     * 推荐人不能是自己
     */
    E_USER_18("E_USER_18", "推荐人不能是自己",0),

    /**
     * 修改的密码与原密码相同
     */
    E_USER_19("E_USER_19", "新的密码不能与原密码相同",0),

    /**
     * 获取验证码失败，该账户不存在！
     */
    E_USER_20("E_USER_20", "获取验证码失败，该账户不存在",0),

    /**
     * 重置密码失败,验证码错误
     */
    E_USER_21("E_USER_21", "重置密码失败,验证码错误",0),


    /**
     * 获取验证码失败,该手机号尚未注册，请先前去注册
     */
    E_USER_22("E_USER_22", "该手机号尚未注册,请先前去注册",0),
    
    /**
     * 验证码过期
     */
    E_USER_23("E_USER_23", "您输入的验证码已过期,请重新获取",0),


    /**
     * 录入推荐人已存在
     */
    E_USER_24("E_USER_24", "推荐人已存在",0),
    
    /**
     * 登陆信息错误
     */
    E_USER_25("E_USER_25", "登陆信息错误",0),
    
    /**
     * 您输入的密码与旧密码相同，请重新输入！
     */
    E_USER_26("E_USER_26", "您输入的密码与旧密码相同，请重新输入！",0),

    /**
     * 该不是白名单用户,没有权限！
     */
    E_USER_27("E_USER_27", "该不是白名单用户,没有权限！",0),

    /**
     * 请1分钟后再次请求获取验证码
     */
    E_USER_28("E_USER_28", "请1分钟后再次请求获取验证码!",0),
    
    /**
     * 货源ID为空或不存在
     */
    E_GOODS_1("E_GOODS_1", "货源ID为空或不存在",0),

    /**
     * 参数错误
     */
    E_GOODS_2("E_GOODS_2", "参数错误",0),

    /**
     * 状态不符
     */
    E_GOODS_3("E_GOODS_3", "状态不符",0),

    /**
     * 没有车辆信息
     */
    E_GOODS_4("E_GOODS_4", "没有车辆信息,无法智能找货",0),

    /**
     * 没有车辆信息
     */
    E_GOODS_5("E_GOODS_5", "删除货源失败",0),

    /**
     * 同一货源只能报价一次
     */
    E_GOODS_6("E_GOODS_6", "同一货源只能报价一次",0),

    /**
     * 同一货源只能报价一次
     */
    E_GOODS_7("E_GOODS_7", "无法对自己发布的货源报价",0),

    /**
     * 您曾撤销了对此货源的报价,无法查看此货源详细信息
     */
    E_GOODS_8("E_GOODS_8", "您曾撤销了对此货源的报价,无法查看此货源详细信息",0),

    /**
     * 您曾撤销了对此货源的报价,无法查看此货源详细信息
     */
    E_GOODS_9("E_GOODS_9", "货源已成交,无法查看货源详细信息",0),

    /**
     * 货源已撤销,无法查看货源详细信息
     */
    E_GOODS_10("E_GOODS_10", "货源已撤销,无法查看货源详细信息",0),

    /**
     * 没有可以撤销的报价
     */
    E_GOODS_11("E_GOODS_11", "没有可以撤销的报价",0),

    /**
     * 请先在[更多应用-完善资料]功能中填写常跑路线
     */
    E_GOODS_12("E_GOODS_12", "请先在[更多应用-完善资料]功能中填写常跑路线",0),

    /**
     * 货源状态已变化,请刷新
     */
    E_GOODS_13("E_GOODS_13", "货源状态已变化,请刷新",0),

    /**
     * 装货日期必须不早于当天
     */
    E_GOODS_14("E_GOODS_14", "装货日期必须不早于当天",0),


    /**
     * 只有承运中的货源才能确认收货"
     */
    E_GOODS_15("E_GOODS_15", "只有承运中的货源才能确认收货",0),


    /**
     * 货源已被他人成交或被货主撤销,请重新选择其它货源"
     */
    E_GOODS_16("E_GOODS_16", "货源已被他人成交或被货主撤销,请重新选择其它货源",0),

    /**
     * 您无法删除未撤销的货源"
     */
    E_GOODS_17("E_GOODS_17", "您无法删除未撤销的货源",0),

    /**
     * 您的报价已被成交,无法撤销
     */
    E_GOODS_18("E_GOODS_18", "您的报价已被成交,无法撤销",0),
    
    /**
     * 该订单不是城内订单!
     */
    E_GOODS_19("E_GOODS_19", "该订单不是城内订单!",0),
    
    /**
     * 该订单不是城际订单!
     */
    E_GOODS_20("E_GOODS_20", "该订单不是城际订单!",0),
    
    /**
     * 指定订单缺少 driverId 参数!
     */
    E_GOODS_21("E_GOODS_21", "指定订单缺少[driverId]或[driverTruckId]参数!",0),
    
    /**
     * 该订单不是指定订单
     */
    E_GOODS_22("E_GOODS_22", "该订单不是指定订单!",0),
    
    /**
     * 你选择的货源已被抢走或撤销,请选择其他货源!
     */
    E_GOODS_23("E_GOODS_23", "你选择的货源已被抢走或撤销,请选择其他货源!",0),
    
    /**
     * 费用参数错误!
     */
    E_GOODS_24("E_GOODS_24", "费用参数错误,运费总和=提付费+到付费+回单费!这是bug,赶紧改!",0),

    /**
     * 您选择的订单已经被承接,无法选择!
     */
    E_GOODS_25("E_GOODS_25", "您选择的订单已经被承接,无法选择!",0),
    
    
    /**
     * 您不能给自己的车辆下单，请重新选车。
     */
    E_GOODS_26("E_GOODS_26", "您不能给自己的车辆下单，请重新选车。",0),
    
    /**
     * 司机已放弃订单,请重新选择司机!
     */
    E_GOODS_27("E_GOODS_27", "司机已放弃订单,请重新选择司机!",0),
    
    /**
     * 司机已承接订单,无法修改!
     */
    E_GOODS_28("E_GOODS_28", "司机已承接订单,无法修改!",0),
    
    /**
     * 提货时间不能大于当前时间!
     */
    E_GOODS_29("E_GOODS_29", "提货时间不能小于当前时间!",0),
    
    /**
     * 司机正在支付信息费,无法修改支付方式!
     */
    E_GOODS_30("E_GOODS_30", "司机正在支付信息费,无法修改支付方式!",0),

    /**
     * 提货类型为具体时间时，提货时间不能为空!
     */
    E_GOODS_31("E_GOODS_31", "提货类型为具体时间时，提货时间不能为空!",0),
    
    /**
     * 卸货验证码不正确
     */
    E_ORDER_1("E_ORDER_1", "您输入的卸货码错误，请重新输入!",0),

    /**
     * 已有退款存在 不能托管
     */
    E_ORDER_2("E_ORDER_2", "已有退款存在,不能托管",0),

    /**
     * 订单超时未支付,订单已撤销
     */
    E_ORDER_3("E_ORDER_3", "订单超时未支付,订单已撤销",0),

    /**
     * 您多次输入错误的提货码,1小时内无法再次输入!
     */
    E_ORDER_4("E_ORDER_4", "您多次输入错误的提货码,1小时内无法再次输入!",0),
    
    /**
     * 订单承接后的状无法修改
     */
    E_ORDER_5("E_ORDER_5", "您的订单已被承接,无法修改",0),
    
    /**
     * 重量体积不可同时为空
     */
    E_ORDER_6("E_ORDER_6", "重量体积不可同时为空",0),
    
    /**
     * 卸货提货码不正确
     */
    E_ORDER_7("E_ORDER_7", "您输入的提货码错误，请重新输入!",0),

    
    /**
     * 您选定的司机已经撤销报价,无法确认成交!
     */
    E_ORDER_8("E_ORDER_8", "您选定的司机已经撤销报价,无法确认成交!",0),
    
    /**
     * 您选定的司机已经撤销抢单,无法确认成交!
     */
    E_ORDER_9("E_ORDER_9", "您选定的司机已经撤销抢单,无法确认成交!",0),
    
    
    /**
     * 因为没有及时承接该订单，货主已取消对您的指派，请下次及时确认承接。
     */
    E_ORDER_10("E_ORDER_10", "因为没有及时承接该订单，货主已取消对您的指派，请下次及时确认承接。",0),
    
    
    /**
     * 您多次输入错误的签收码,1小时内无法再次输入!
     */
    E_ORDER_11("E_ORDER_11", "您多次输入错误的签收码,1小时内无法再次输入!",0),
    
    
    /**
     * 签收码不正确
     */
    E_ORDER_12("E_ORDER_12", "您输入的签收码错误，请重新输入!",0),
    
    /**
     * 该订单已被签收!
     */
    E_ORDER_13("E_ORDER_13", "该订单已被签收!",0),
 
    /**
     * 订单已过期,系统已自动撤销此订单!
     */
    E_ORDER_14("E_ORDER_14", "订单已过期,系统已自动撤销此订单!",0),
    
    /**
     * 司机已承接了此订单,您无法撤销!
     */
    E_ORDER_15("E_ORDER_15", "司机已承接了此订单,您无法撤销!",0),
    
    /**
     * 该订单已撤销!
     */
    E_ORDER_16("E_ORDER_16", "该订单已撤销!",0),
    
    /**
     * 该货源到达提货时间未成交,系统已自动帮您撤销,请重新发布!
     */
    E_ORDER_17("E_ORDER_17", "该货源到达提货时间未成交,系统已自动帮您撤销,请重新发布!",0),
    
    /**
     * 司机已承接了此订单,无法取消!
     */
    E_ORDER_18("E_ORDER_18", "司机已承接了此订单,无法取消!",0),

    /**
     * 该订单已被删除!
     */
    E_ORDER_19("E_ORDER_19", "该订单已被删除!",0),


    /**
     * 不能对自己进行评价
     */
    E_CREDIT_1("E_CREDIT_1", "不能对自己进行评价",0),

    /**
     * 钱包支付失败:风控金额未审核或审核未通过
     */
    E_WALLET_1("E_WALLET_1", "钱包支付失败:风控金额未审核或审核未通过",0),

    /**
     * 钱包请求失败:退款冻结支付账单失败
     */
    E_WALLET_2("E_WALLET_2", "钱包请求失败:退款冻结支付账单失败",0),

    /**
     * 商品剩余数量不足
     */
    E_SCORE_1("E_SCORE_1", "该商品已兑换完,请选择别的商品!",0),

    /**
     * 用户积分不足
     */
    E_SCORE_2("E_SCORE_2", "用户积分不足",0),

    /**
     * 积分规则尚未设置
     */
    E_SCORE_3("E_SCORE_3", "积分规则尚未设置",0),

    /**
     * 积分黑名单
     */
    E_SCORE_4("E_SCORE_4", "您已上积分黑名单，无法赠送积分",0),

    /**
     * 积分黑名单
     */
    E_SCORE_5("E_SCORE_5", "您的账号暂时无法获取签到积分，请联系客服！",0),

    /**
     * 已签到
     */
    E_SCORE_6("E_SCORE_6", "你今天已签到,请勿重复签到！",0),

    /**
     * 身份认证失败
     */
    E_AUTH_1("E_AUTH_1", "身份认证接口调用失败",0),
    
    /**
     * 消息中心调用失败
     */
    E_MSGCENTER_1("E_MSGCENTER_1", "消息中心调用失败!",0),
    
    /**
     * 第一辆车还在审核中
     */
    E_TRUCK_1("E_TRUCK_1", "第一辆车还在审核中",0),
    
    /**
     * 审核中车辆不允许修改
     */
    E_TRUCK_2("E_TRUCK_2", "审核中车辆不允许修改",0),
    
    /**
     * 车辆不存在
     */
    E_TRUCK_3("E_TRUCK_3", "车辆不存在",0),
	
	/**
     * 对方已经是您的熟车,无法重复添加!
     */
    E_TRUCK_4("E_TRUCK_4", "车辆对方已经是您的熟车,无法重复添加!",0),
    
    /**
     * 您添加的车牌号已存在，请重新填写!
     */
    E_TRUCK_5("E_TRUCK_5", "您添加的车牌号已存在，请重新填写!",0),
    
    /**
     * 您还未添加任何车辆，无法操作。请前去添加您的车辆。
     */
    E_TRUCK_6("E_TRUCK_6", "您还未添加任何车辆，无法操作。请前去添加您的车辆。",0),
    
    /**
     * 您提交的车辆信息还在认证中，暂时无法操作，请耐心等待。
     */
    E_TRUCK_7("E_TRUCK_7", "您提交的车辆信息还在认证中，暂时无法操作，请耐心等待。",0),
    
    /**
     * 您提交的车辆信息认证失败，请您重新提交。
     */
    E_TRUCK_8("E_TRUCK_8", "您提交的车辆信息认证失败，请您重新提交。",0),
    
    /**
     * 添加认证车辆时,必须上传车头照和行驶证件照片!
     */
    E_TRUCK_9("E_TRUCK_9", "添加认证车辆时,必须上传车头照片和行驶证件照片!",0),

    /**
     * 添加熟车时，已邀请过对方
     */
    E_TRUCK_10("E_TRUCK_10", "您已邀请过该司机,请等待对方确认!",0),

    /**
     * 添加熟车时，用户存在但无认证车辆
     */
    E_TRUCK_11("E_TRUCK_11", "已发送邀请,等待对方确认!",0),

    /**
     * 该订单运费不需托管!
     */
    E_BILL_1("E_BILL_1", "该订单运费不需托管!",0),
    
    /**
     * 对方已发起退款,点击确定刷新订单信息!
     */
    E_BILL_2("E_BILL_2", "对方已发起退款,点击确定刷新订单信息!",0),

    /**
     * 此订单已退款,点击确定前往钱包查看账单!
     */
    E_BILL_3("E_BILL_3", "此订单已退款,点击确定前往钱包查看账单!",0),

    /**
     * 司机已提货,提付运费将无法退款,是否继续退款!
     */
    E_BILL_4("E_BILL_4", "司机已提货,提付运费将无法退款,是否继续退款!",0),

    /**
     * 司机已签收订单,无法退款,点击确定刷新订单信息!
     */
    E_BILL_5("E_BILL_5", "司机已签收订单,无法退款,点击确定刷新订单信息!",0),

    /**
     * 您发起的退款已完成,点击确定前往钱包查看账单.
     */
    E_BILL_6("E_BILL_6", "您发起的退款已完成,点击确定前往钱包查看账单。",0),

    /**
     * 处理成功
     */
    E_BILL_7("E_BILL_7", "处理成功!",0),

    /**
     * 退款已失效!
     */
    E_BILL_8("E_BILL_8", "退款已失效!",0),

    /**
     * 您发起的退款已完成,点击确定前往钱包查看账单!
     */
    E_BILL_9("E_BILL_9", "您发起的退款已完成,点击确定前往钱包查看账单!",0),

    /**
     * 退款已取消,点击确定刷新订单信息。
     */
    E_BILL_10("E_BILL_10", "退款已取消,点击确定刷新订单信息。",0),

    /**
     * 客服已介入,稍后电话联系您,请保持电话畅通。
     */
    E_BILL_11("E_BILL_11", "客服已介入,稍后电话联系您,请保持电话畅通。",0),

    /**
     * 客服已关闭退款,点击确定刷新订单信息。
     */
    E_BILL_12("E_BILL_12", "客服已关闭退款,点击确定刷新订单信息。",0),

    /**
     * 此订单已退款,点击确定前往钱包查看账单。
     */
    E_BILL_13("E_BILL_13", "此订单已退款,点击确定前往钱包查看账单。",0),

    /**
     * 客服正在处理退款申请,请耐心等候!
     */
    E_BILL_14("E_BILL_14", "客服正在处理退款申请,请耐心等候!",0),

    E_Mall_1("E_Mall_1", "该产品已兑换完,请选择别的产品!",0),

    /**
     * 您输入的账号尚未注册,请重新输入
     */
    E_OFFLINE_1("E_OFFLINE_1", "您输入的账号尚未注册,请重新输入",0),

    /**
     * 账号权限未开通,请更换账号或申请开通权限后再试!
     */
    E_OFFLINE_2("E_OFFLINE_2", "账号权限未开通,请更换账号或申请开通权限后再试",0),

    /**
     * 账号或密码错误
     */
    E_OFFLINE_3("E_OFFLINE_3", "账号或密码错误",0),

    /**
     * 该身份证已绑定用户
     */
    E_OFFLINE_4("E_OFFLINE_4", "该身份证已绑定用户\n",0);


    ErrorCode(String code, String msg,Integer msgcenter) {
        this.code = code;
        this.msg = msg;
        this.msgcenter = msgcenter;
    }

    private String code;

    private String msg;
    
    private Integer msgcenter;
    
    public Integer getMsgcenter() {
        return this.msgcenter;
    }

    public String getCode() {
        return this.code;
    }

    public String getMsg() {

        return this.msg;
    }
    
    public static ErrorCode getErrorCode(Integer msgc) {

		for (ErrorCode d : ErrorCode.values()) {
			if (d.getMsgcenter().equals(msgc)) {
				return d;
			}
		}
		return null;
	}
    
}
