package com.topjet.common;

public enum ExceptionEnum {
    E_SYS_MSG("00", "系统异常，请联系管理员！"),

    E_BUSINESS_MSG("01", "业务异常，请联系管理员！"),

    E_0("02", "操作成功!"),

    E_DATA_EXPIRED("03", "数据过期"),

    E_1("04", "用户已存在"),

    E_2("05", "对应数据不存在!"),

    E_3("06", "操作失败!"),

    E_4("07", "该手机号码未注册，不能推送消息"),

    E_5("08", "输入版本低于当前版本"),

    E_6("09", "用户冻结失败"),
    E_7("10", "操作成功！设置将于明日0：00开始生效。"),
    E_8("11", "数据已被删除"),
    E_9("12", "其他人也在添加该车的违章记录"),
    E_10("13", "用户不存在或密码错误!"),
    E_11("14", "不能投诉自己!"),
    E_12("15", "用户已被禁用，请联系管理员!"),
    E_13("16", "请求钱包系统处理失败"),
    E_14("17", "改用户被锁定"),
    E_15("18", "登录过期请从新登录！"),
    E_16("19", "您无权登陆此系统！"),
    E_17("20", "此项下有子菜单,请先删除全部子菜单后，再进行操作！"),
    E_18("21", "您输入的手机号还未认证通过，请重新输入。"),
    E_19("22", "您输入的手机号账户异常，请重新输入。"),
    E_20("23", "您输入的手机号账户不存在，请重新输入。"),
    E_21("24", "您输入的手机号已在白名单列表，请重新输入。"),
    E_22("25", "删除失败，该部门下还存在用户。"),
    E_23("26", "操作失败，您无权操作此用户信息"),
    E_24("27", "操作失败，此用户下还有用户,无法进行删除。"),
    E_25("28", "认证失败"),
    E_26("29", "此身份证号已存在，请驳回!"),
    E_27("30", "一小时内仅能发送一次公告推送!"),
    E_28("31", "您输入的邮箱账户不存在，请重新输入!"),
    E_29("32", "您输入的邮箱已在白名单列表，请重新输入。"),
    E_30("33", "您输入的标签已存在，请重新输入。"),
    E_31("34", "请勿输入多条标签！"),
    E_32("35", "服务站类型已存在，请重新输入！"),
    E_33("36", "当前最多开启3条货源广告！"),
    E_34("37", "服务站名称已存在，请重新创建！"),
    E_35("38", "调研报告最少4条，最多10条！"),
    E_36("39", "审核失败，当前车辆最多绑定5名司机！"),
    E_37("40", "操作失败，请求服务端接口失败！");



    ExceptionEnum(String status, String msg) {
        this.status = status;
        this.msg = msg;
    }

    private String status;
    private String msg;

    public String getStatus() {
        return this.status;
    }

    public String getMsg() {

        return this.msg;
    }
}
